LEXICON_RU: dict[str, str] = {
    '/start': 'Привет!\n\nЯ эхо-бот для демонстрации работы роутеров!\n\n'
              'Если хотите - можете мне что-нибудь прислать или '
              'отправить команду /help',
    '/help': 'Я просто отправляю вам копию вашего сообщения',
    'error': 'К сожалению, не могу тебя понять',
    'choose_mode': 'Выберите один из режимов шифрования:',
    'choose_padding': 'Выберите один из режимов дополнения последнего блока:'
}

LEXICON_COMMANDS_RU: dict[str, str] = {
    '/start': 'Начало работы с ботом',
    '/help': 'Инструкция',
    '/password': 'Задать ключ шифрования',
    '/mode': 'Задать режим шифрования',
    '/padding': 'Задать режим дополнения последнего блока',
    '/encrypt': 'Зашифровать сообщение',
    '/decrypt': 'Расшифровать бинарный файл',
}